<?php

/**
 * Touch Open Source Project
 * ============================================================================
 * Copyright (c) 2012-2014 http://Touch.cn All rights reserved.
 * ----------------------------------------------------------------------------
 * 文件名称：index.php
 * ----------------------------------------------------------------------------
 * 功能描述：Touch项目入口文件
 * ----------------------------------------------------------------------------
 * Licensed (  )
 * ----------------------------------------------------------------------------
 */

/* 访问控制 */
define('IN_Touch', true);
/* 设置系统编码格式 */
header("Content-Type:text/html;charset=utf-8");
/* 设置系统编码格式 */
header("Pragma: no-cache");
/* 修复后退没有提交数据的问题 */
header("Cache-control: private");
/* 加载核心文件 */ 
require ('include/Touch.php');
