<?php

/**
 * Touch Open Source Project
 * ============================================================================
 * Copyright (c) 2012-2014 http://Touch.cn All rights reserved.
 * ----------------------------------------------------------------------------
 * 文件名称：respond.php
 * ----------------------------------------------------------------------------
 * 功能描述：支付接口通知文件
 * ----------------------------------------------------------------------------
 * Licensed (  )
 * ----------------------------------------------------------------------------
 */

/* 访问控制 */
define('IN_Touch', true);
if(!isset($_REQUEST['code'])){
    header('location: ./index.php?'.$_SERVER['QUERY_STRING']);
    exit;
}
define('CONTROLLER_NAME', 'Respond');
/* 加载核心文件 */
require ('include/Touch.php');
