<?php

/**
 * Touch Open Source Project
 * ============================================================================
 * Copyright (c) 2012-2014 http://Touch.cn All rights reserved.
 * ----------------------------------------------------------------------------
 * 文件名称：WechatControoller.class.php
 * ----------------------------------------------------------------------------
 * 功能描述：微信公众平台API
 * ----------------------------------------------------------------------------
 * Licensed (  )
 * ----------------------------------------------------------------------------
 */

/* 访问控制 */
defined('IN_Touch') or die('Deny Access');

class WechatController extends CommonController {}